ams/src/Documents/_УстановкаСтоимостиРабот/_УстановкаСтоимостиРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>_УстановкаСтоимостиРабот</name>
  <registerRecords>InformationRegister._ЦеныФасовкиПродукции</registerRecords>
  <registerRecords>InformationRegister._ЦеныРабот</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef._Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/InformationRegisters/_ЦеныФасовкиПродукции/_ЦеныФасовкиПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>_ЦеныФасовкиПродукции</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/InformationRegisters/_ЦеныРабот/_ЦеныРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>_ЦеныРабот</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <dimensions>
    <name>Работа</name>
    <type>
      <types>CatalogRef._Работы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/Documents/_УстановкаСтоимостиРабот/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения._ЦеныФасовкиПродукции.Записывать = Истина;
	Для Каждого Стр Из Товары Цикл
		Движение = Движения._ЦеныФасовкиПродукции.Добавить();

		Движение.Период       = Дата;
		Движение.Номенклатура = Стр.Номенклатура;
		Движение.Цена         = Стр.Цена;
	КонецЦикла;

	Движения._ЦеныРабот.Записывать = Истина;
	Для Каждого Стр Из Работы Цикл
		Движение = Движения._ЦеныРабот.Добавить();

		Движение.Период = Дата;
		Движение.Работа = Стр.Работа;
		Движение.Цена   = Стр.Цена;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
